print("Сидорова Олександра Сергіївна\nЛабораторна робота №1 \nВаріант 18 \nЗнаходження суми арифметичної прогресії \n")
while True:
    try:
        print("Введіть перший член прогресії ")
        a = int(input())
        print("Введіть різницю прогресії ")
        d = int(input())
        print("Введіть число членів прогресії ")
        n = int(input())
        print("Сума членів прогресії")
        s = ((2*a+d*(n-1))/2)*n
        print(s)
    except:
        print("Помилка")
        print("Для продовження введіть 1\nДля виходу введіть 0")
        b = input()
        while b != "1" and b != "0":
            print("Ви ввели некоректні дані")
            b = input()
        if b==0:
            break
